In [1]:
import pandas as pd
data = [10, 20, 30, 40, 50]
sp=pd.Series(data)
print (sp)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
print (sp[2])

30

In [5]:
print(sp.iloc[3])

40

In [18]:
import pandas as pd
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Mary'],
        'Age': [25, 30, 35, 28, 30],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago','Boston']}
df=pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago
4     Mary   30         Boston

In [19]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [8]:
print(df.iloc[2])   # Access the third row by position

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [4]:
print(df.loc[1])    # Access the second row by label

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [24]:
print(df[['Name', 'Age']])  # Select specific columns

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4     Mary   25

In [26]:
dfname=df[['Name','Age']]
dfname

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4     Mary   30

In [25]:
print(df[1:3])             # Select specific rows

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [26]:
unique_dates = df['Age'].unique()
print(unique_dates)

[25 30 35 28]

In [27]:
high_above_102 = df[df['Age'] > 25]
print(high_above_102)

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [14]:
high_above_102 = df[df['Age'] > 25]

In [5]:
sAge=df[df['Age']==30]
print (sAge)

   Name  Age           City
1   Bob   30  San Francisco
4  Mary   30         Boston

In [30]:
df.to_csv('myfile.csv', index=False)

In [32]:
df.shape

(5, 3)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [34]:
df.describe()

             Age
count   5.000000
mean   29.600000
std     3.646917
min    25.000000
25%    28.000000
50%    30.000000
75%    30.000000
max    35.000000

In [14]:
df.head(),df.tail()

(      Name  Age           City
 0    Alice   25       New York
 1      Bob   30  San Francisco
 2  Charlie   35    Los Angeles
 3    David   28        Chicago
 4     Mary   30         Boston,
       Name  Age           City
 0    Alice   25       New York
 1      Bob   30  San Francisco
 2  Charlie   35    Los Angeles
 3    David   28        Chicago
 4     Mary   30         Boston)

In [16]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [27]:
df1=df[['Name', 'Age']]
df1.head()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4     Mary   30

In [49]:
df['Age'].mean(),df['Age'].sum(), df.min(), df.max()

(29.6,
 148,
 Name     Alice
 Age         25
 City    Boston
 dtype: object,
 Name             Mary
 Age                35
 City    San Francisco
 dtype: object)

In [40]:
df.sort_values("Name")

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago
4     Mary   30         Boston

In [60]:
df.groupby(level=0).mean()

/var/folders/59/bpzh77cn7258f0vtn29zls440000gn/T/ipykernel_26783/3607688641.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(level=0).mean()

    Age
0  25.0
1  30.0
2  35.0
3  28.0
4  30.0

In [62]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object